ejemplos_clase/laravel/ejemplo2/app/Http/Controllers/LibroController.php

    public function index(Request $request)
    {
        // $libros=Libro::orderBy('id')->paginate(5);
        $titulo=$request->get('titulo');
        $sinopsis=$request->get('sinopsis');
        $libros=Libro::orderBy('id')
        ->titulo($titulo)
        ->sinopsis($sinopsis)
        ->paginate(5);
---
select * from `libros` where `titulo` like '%%' and `sinopsis` like '%%' order by `id` asc limit 5 offset 0
select count(*) as aggregate from `libros` where `titulo` like '%%' and `sinopsis` like '%%'